core/app/Http/Controllers/AuthorizationController.php

select * from `monthly_subscriptions` where `user_id` = 2 order by `created_at` desc limit 1
---
    public function monthly_subscription()
    {
        $user_id = auth()->user()->id;
        $monthly_subscription = MonthlySubscription::where('user_id',$user_id)
                                                    ->latest()
                                                    ->first();