core/app/Http/Controllers/HomeController.php

    function planIndex()
    {


        $data['page_title'] = "Plans";

        $data['plans'] = Plan::whereStatus(1)->get();
---
select * from `plans` where `status` = 1

    function matrixIndex($lv_no)
    {


        $gnl = GeneralSetting::first();
        if ($lv_no > $gnl->matrix_height) {

            $notify[] = ['error', 'No Level Found.'];

            return redirect()->route('home')->withNotify($notify);
        }
        $data['page_title'] = "My Level " . $lv_no . " Referrer";
        $data['lv_no'] = $lv_no;
        $data['referral'] = User::where('position_id', auth()->id())->get();
---
select * from `users` where `position_id` = 2

    function searchUser(Request $request)
    {
        $trans_user = User::where('id', '!=', Auth::id())->where('username', $request->username)
            ->orwhere('email', $request->username)->count();
---
select count(*) as aggregate from `users` where `id` != 2 and `username` = 'ping.afrasiyab.haider@' or `email` = 'ping.afrasiyab.haider@'