core/app/Http/Controllers/SiteController.php

select * from `frontends` where `key` = 'blog.title' or `key` = 'testimonial.title' or `key` = 'service.title' or `key` = 'howWork.title' or `key` = 'about.title' or `key` = 'vid.post' or `key` = 'plan.title'
select * from `frontends` where `key` = 'blog.post' order by `created_at` desc limit 3
select * from `frontends` where `key` = 'banner'
select * from `frontends` where `key` = 'testimonial'
select * from `frontends` where `key` = 'service.item'
select * from `plans` where `status` = 1
select * from `frontends` where `key` = 'howWork.item'
---
    public function home()
    {

        $data['page_title'] = "Home";

        $frontend = Frontend::where('key', 'blog.title')->OrWhere('key', 'testimonial.title')
            ->orWhere('key', 'service.title')->orWhere('key', 'howWork.title')
            ->orWhere('key', 'about.title') ->orWhere('key', 'vid.post')->orWhere('key', 'plan.title')->get();


        $data['blog_title'] = $frontend->where('key', 'blog.title')->first() ;
        $data['blogs'] = Frontend::where('key', 'blog.post')->latest()->take(3)->get();
        $data['sliders'] = Frontend::where('key', 'banner')->get();

        $data['testimonial_title'] = $frontend->where('key', 'testimonial.title')->first();
        $data['testimonial'] = Frontend::where('key', 'testimonial')->get();
        $data['service_titles'] = $frontend->where('key', 'service.title')->first();
        $data['service'] = Frontend::where('key', 'service.item')->get();
        $data['about'] = $frontend->where('key', 'about.title')->first();
        $data['plans'] = Plan::where('status', 1)->get();
        $data['plan_title'] = $frontend->where('key', 'plan.title')->first();

        $data['how_it_work_title'] = $frontend->where('key', 'howWork.title')->first();
        $data['video_section'] = $frontend->where('key', 'vid.post')->first();

        $data['how_it_work'] = Frontend::where('key', 'howWork.item')->get();