core/app/Http/Controllers/UserController.php

select sum(`amount`) as aggregate from `deposits` where `user_id` = 2 and `status` = 1
select sum(`amount`) as aggregate from `withdrawals` where `user_id` = 2 and `status` = 1
select sum(`amount`) as aggregate from `trxes` where `user_id` = 2 and `type` = 11
select sum(`amount`) as aggregate from `trxes` where `user_id` = 2 and `type` = 4
select sum(`amount`) as aggregate from `trxes` where `user_id` = 2 and `type` = 9
select count(*) as aggregate from `users` where `ref_id` = 2
select count(*) as aggregate from `users` where `position_id` = 2
---
    public function home()
    {
        $page_title = 'Dashboard';


        $user = Auth::user();
        $data['page_title'] = "Dashboard";
        $data['total_deposit'] = Deposit::whereUserId($user->id)->whereStatus(1)->sum('amount');
        $data['total_withdraw'] = Withdrawal::whereUserId($user->id)->whereStatus(1)->sum('amount');


        $data['ref_com'] = Trx::whereUserId($user->id)->whereType(11)->sum('amount');
        $data['level_com'] = Trx::whereUserId($user->id)->whereType(4)->sum('amount');
        $data['total_epin_recharge'] = Trx::whereUserId($user->id)->whereType(9)->sum('amount');
        $data['total_epin_generate'] = Trx::whereUserId($user->id)->whereType(10)->sum('amount');
        $data['total_bal_transfer'] = Trx::whereUserId($user->id)->whereType(8)->sum('amount');

        $data['total_direct_ref'] = User::where('ref_id', $user->id)->count();

        $data['total_paid_width'] = User::where('position_id', $user->id)->count();

select * from `users` where `ref_id` = 2
---
    public function getCharts()
    {
        $user = Auth::user();
        $users = User::where('ref_id',$user->id)->get()->groupBy(function($val)
        {
            return Carbon::parse($val->created_at)->format('m');
        })->map(function ($row) {
            return $row->count('id');
        });

select * from `users` where `ref_id` = 2 and `plan_id` != 0 and `users`.`deleted_at` is null
---
    public function reffPlansChart()
    {
        $user = Auth::user();
        $user_plans = User::where('ref_id',$user->id)->where('plan_id','!=',0)->get()->groupBy('plan_id')->map(function ($row) {
            return $row->count('plan_id');
        });