core/app/Http/Controllers/Gateway/PaymentController.php

    public function depositInsert(Request $request)
    {

        $this->validate($request, [
            'amount' => 'required|numeric|min:1',
            'method_code' => 'required',
            'currency' => 'required',
        ]);
        $gate = GatewayCurrency::where('method_code', $request->method_code)->where('currency', $request->currency)->first();
---
select * from `gateway_currencies` where `method_code` = '101' and `currency` = 'EUR' limit 1