core/app/Http/Controllers/Admin/SupportTicketController.php

    public function index()
    {
        $users = User::orderBy('username','ASC')->get();
        $page_title = 'Support Tickets';
        $empty_message = 'No support ticket';
        $tickets = SupportTicket::orderByDesc('status')->latest()->paginate(config('constants.table.default'));
---
select * from `users` order by `username` asc
select * from `support_tickets` order by `status` desc, `created_at` desc limit 15 offset 0
select count(*) as aggregate from `support_tickets`