core/app/Http/Controllers/Admin/WithdrawalController.php

    public function pending()
    {
        $page_title = 'Pending Withdrawals';
        $withdrawals = Withdrawal::where('status', 2)->latest()->paginate(config('constants.table.default'));
---
select * from `withdrawals` where `status` = 2 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `withdrawals` where `status` = 2

    public function reject(Request $request)
    {
        $request->validate(['id' => 'required|integer']);
        $withdraw = Withdrawal::findOrFail($request->id);


        $user = User::find($withdraw->user_id);
        $user->balance += $withdraw->amount;
        $user->save();

        $withdraw->update(['status' => 3]);

        $withdraw->user->transactions()->save(new Trx([
            'amount' => $withdraw->amount,
            'main_amo' => $withdraw->amount,
            'charge' => 0,
            'type' => 'withdraw',
            'title' => 'withdraw rejected Via  ' . $withdraw->method->name,
            'trx' => $withdraw->trx,
            'balance' => $user->balance,
        ]));
---
select * from `users` where `users`.`id` = 2 limit 1
update `users` set `balance` = 90, `users`.`updated_at` = '2020-07-03 16:16:07' where `id` = 2
update `withdrawals` set `status` = 3, `withdrawals`.`updated_at` = '2020-07-03 16:16:07' where `id` = 4
insert into `trxes` (`amount`, `main_amo`, `charge`, `type`, `title`, `trx`, `balance`, `user_id`, `updated_at`, `created_at`) values ('10.00000000', '10.00000000', 0, 'withdraw', 'withdraw rejected Via  Coupon', 'SYURGHWGOR1M', 90, 2, '2020-07-03 16:16:07', '2020-07-03 16:16:07')