core/app/Http/Helpers/helpers.php

select * from `email_sms_templates` where `act` = 'WITHDRAW_REJECT' and `sms_status` = 1 limit 1
---
function send_sms($user, $type, $shortcodes = [])
{
    $general = GeneralSetting::first(['sn', 'smsapi']);
    $sms_template = \App\SmsTemplate::where('act', $type)->where('sms_status', 1)->first();

select * from `plugins` where `act` = 'google-recaptcha3' and `status` = 1 limit 1
---
function recaptcha()
{
    $recaptcha = \App\Plugin::where('act', 'google-recaptcha3')->where('status', 1)->first();

select * from `users` where `position_id` = 2
---
function showBelow($id)
{
    $arr = array();
    $under_ref = \App\User::where('position_id', $id)->get();

select * from `users` where `id` = 7 limit 1
select * from `users` where `id` = 2 limit 1
---
function showUserLevel($id, $level)
{

    $gnl = GeneralSetting::first();

    $myref = showBelow($id);
    $nxt = $myref;
    for ($i = 1; $i < $level; $i++) {
        $nxt = array();
        foreach ($myref as $uu) {
            $n = showBelow($uu);
            $nxt = array_merge($nxt, $n);
        }
        $myref = $nxt;
    }


    foreach ($nxt as $uu) {
        $data = \App\User::where('id', $uu)->first();
        $pos = \App\User::where('id', $data->position_id)->first();
        $ref = \App\User::where('id', $data->ref_id)->first();