core/app/Http/Controllers/Auth/LoginController.php

select * from `plugins` where `act` = 'google-recaptcha3' and `status` = 1 limit 1
---
    protected function validateLogin(Request $request)
    {
        $recaptcha = \App\Plugin::where('act', 'google-recaptcha3')->where('status', 1)->first();