core/app/Http/Controllers/Auth/RegisterController.php

select * from `users` where `username` = 'afrasiyab' limit 1
---
    public function showRegistrationFormRef($username){


        $ref_user = User::where('username', $username)->first();